Revit 2027 API
EnergyAnalysisConstruction.ThermalTransmittance Property
 The thermal transmittance value (U-value) of the construction, in W/(m^2*K) (equivalent to kg/(k*s^3)).
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ThermalTransmittance { get; }
Public ReadOnly Property ThermalTransmittance As Double
	Get
public:
property double ThermalTransmittance {
	double get ();
}
member ThermalTransmittance : float with get
Property Value
Double
See Also
Reference
EnergyAnalysisConstruction Class
Autodesk.Revit.DB.Analysis Namespace